---
kind: type
id: T:Autodesk.Revit.DB.BackgroundStyle
source: html/fcca4b4b-d2bb-b286-64ef-9345f1a39585.htm
---
# Autodesk.Revit.DB.BackgroundStyle

Indicates the background style in rendering settings.

## Syntax (C#)
```csharp
public enum BackgroundStyle
```